---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsHideTopLevelParameter
source: html/dde7237c-3ea0-2ea7-7782-90f197e4a31c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsHideTopLevelParameter Property

You have set the stair's multistory top level to None, and Revit will remove this parameter, if you want to create a multistory stair, please use Create Multistory Stair feature.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryStairsHideTopLevelParameter { get; }
```